Codigniter/CRUD/codeigniter_crud/app/Controllers/User.php

SELECT *
FROM `users`
---
    public function index()
    {
        $users = $this->userModel->findAll();

INSERT INTO `users` (`name`, `email`) VALUES ('Ali Raza', 'aliraza88@gmail.com')
---
    public function create(){
        $response_array = [];

        if($_SERVER['REQUEST_METHOD'] == 'POST'){
            $input = $this->validate([
                'name' => 'required',
                'email' => 'required|valid_email'
            ]);

            if($input){
                // save user record
                $is_saved = $this->userModel->save([
                    'name' => $this->request->getVar('name'),
                    'email' => $this->request->getVar('email'),
                ]);

UPDATE `users` SET `name` = 'Osama Ahmad', `email` = 'osama916@gmail.com'
WHERE `users`.`user_id` IN ('2')
SELECT *
FROM `users`
WHERE `users`.`user_id` = '2'
---
    public function edit(){
        $response_array = array();
        $userid = $this->request->getVar('id');

        if($_SERVER['REQUEST_METHOD'] == 'POST'){
            $input = $this->validate([
                'name' => 'required',
                'email' => 'required|valid_email'
            ]);

            if($input){
                // save user record
                $is_saved = $this->userModel->update($id = $this->request->getVar('id'),
                    [
                        'name' => $this->request->getVar('name'),
                        'email' => $this->request->getVar('email'),
                    ]
                );

                if($is_saved){
                    // return the view with success message
                    array_push($response_array, array('Success' => 'Data Saved Successfully'));
                }else{
                    array_push($response_array, array('Failed' => 'Data Save Procedure Failed'));
                }

                return redirect()->to('/edit?id='.$userid);
            }
        }else{
            $user = $this->userModel->find($userid);

DELETE FROM `users`
WHERE `user_id` IN ('4')
---
    public function delete(){
        $userId = $this->request->getVar('id');

        $is_deleted = $this->userModel->delete($userId);